import Container from "../../Сontainer/Сontainer";
import photoPath from "../../../assets/images/others/cabbage.png";
import { useState } from "react";
import "../FAQ/faq.scss";

const faqItems = [
  {
    id:1,
    title: "Как добавить рецепт ?",
    answer: `Авторизуйтесь и перейдите на страничку профиля. Нажмите на кнопку “Добавить рецепт”, заполните все поля и нажмите “Опубликовать”. Готово!`,
  },
  {
    id:2,
    title: "Можно ли найти моих знакомых в блоге?",
    answer: `Если ваши знакомые зарегистрировались, то вы можете найти их по никкнейму в поиске, находящемся в шапке профиля!`,
  },
  {
    id:3,
    title: "Можно ли добавить видео с рецептом?",
    answer: `К сожалению пока такая функция не реализована, но в ближайшем будущем мы собираемся ее внедрить!`,
  },
  {
    id:4,
    title: "Как добавить рецепт ?",
    answer: `Авторизуйтесь и перейдите на страничку профиля. Нажмите на кнопку “Добавить рецепт”, заполните все поля и нажмите “Опубликовать”. Готово!`,
  },
];

const Faq = () => {
  return (
    <Container>
      <div className="questions">
        <h2>
          Часто <span>задаваемые</span> вопросы
        </h2>
        <div className="questions__inner">
          <div className="faq">
            {faqItems.map((item, index) => {
              const [isOpen, setIsOpen] = useState(false);
              return (
                <div className={`${isOpen ? 'active' : ''} faq__item`} key={index}>
                  <div className="title">
                    <h4>{item.title}</h4>
                    <button onClick={()=>setIsOpen(!isOpen)} className={`${isOpen ? 'active' : ''}`}>
                      <svg
                        width="40"
                        height="38"
                        viewBox="0 0 40 38"
                        fill="none"
                        xmlns="http://www.w3.org/2000/svg"
                      >
                        <path
                          d="M22.1667 28.4969V21.0802H30C30.5666 21.0802 31.1149 20.8667 31.5229 20.479C31.9319 20.0905 32.1667 19.558 32.1667 18.9969C32.1667 18.4359 31.9319 17.9033 31.5229 17.5148C31.1149 17.1272 30.5666 16.9136 30 16.9136H22.1667V9.49691C22.1667 8.93586 21.9319 8.40331 21.5229 8.01482C21.1149 7.62716 20.5666 7.41357 20 7.41357C19.4334 7.41357 18.8852 7.62716 18.4772 8.01482C18.0682 8.40331 17.8334 8.93586 17.8334 9.49691V16.9136H10C9.43344 16.9136 8.88522 17.1272 8.47716 17.5148L8.81983 17.8755L8.47715 17.5148C8.06822 17.9033 7.83337 18.4359 7.83337 18.9969C7.83337 19.558 8.06822 20.0905 8.47716 20.479C8.88522 20.8667 9.43344 21.0802 10 21.0802H17.8334V28.4969C17.8334 29.058 18.0682 29.5905 18.4772 29.979C18.8852 30.3667 19.4334 30.5802 20 30.5802C20.5666 30.5802 21.1149 30.3667 21.5229 29.979C21.9319 29.5905 22.1667 29.058 22.1667 28.4969Z"
                          fill="black"
                          stroke="black"
                        />
                      </svg>
                    </button>
                  </div>
                  <div className={`${isOpen ? 'active' : ''} answer`} >{item.answer}</div>
                </div>
              );
            })}
          </div>
          <img src={photoPath} alt="cabbage" />
        </div>
      </div>
    </Container>
  );
};

export default Faq;
