import Container from "../Сontainer/Сontainer";
import "../Footer/footer.scss";
import logo from "../../assets/images/logo/logo_white.svg";
import { Link } from "react-router-dom";

const Footer = () => {
  return (
    <footer className="footer ">
      <Container>
        <div className="footer-inner d-flex-columns w-100">
          <div className="footer-top w-100 d-flex-rows">
            <div className="footer-info d-flex-columns">
              <img src={logo} alt="vilkaLozhka" className="logo" />
              <p>
                Телефон горячей линии:{" "}
                <a href="tel:+79179115262">+7(917) 911-52-62</a>
              </p>
              <p>
                Электронная почта:{" "}
                <a href="mailto:homechefru@gmail.ru">homechefru@gmail.ru</a>
              </p>
              <a
                href="https://policies.google.com/privacy?hl=ru"
                className="pr"
              >
                Политика конфиденциальности
              </a>
            </div>

            <div className="footer-nav d-flex-columns">
              <h4>Помощь</h4>
              <Link to="/">Главная</Link>
              <Link to="/">Рецепты</Link>
              <Link to="/">FAQ</Link>
              <Link to="/">Добавить рецепт</Link>
              <Link to="/">Руководство пользователя</Link>
            </div>

            <div className="footer-sub d-flex-columns">
              <h3>Получайте закрытые предложения и акции</h3>
              <form action="#" className="d-flex-rows">
                <input type="text" placeholder="Электронная почта" />
                <button type="submit">Подписаться</button>
              </form>
              <div className="agree d-flex-rows">
                <input type="checkbox" />
                <p>
                  Нажимая на кнопку я подтверждаю согласие на получение рассылки
                  и обработку персональных данных
                </p>
              </div>
              <div className="socials d-flex-rows">
                <a href="telegram">
                  <svg
                    width="26"
                    height="27"
                    viewBox="0 0 26 27"
                    fill="none"
                    xmlns="http://www.w3.org/2000/svg"
                  >
                    <path
                      d="M23.8893 2.45844L0.85451 11.3871C-0.0724508 11.8029 -0.385974 12.6356 0.630463 13.0875L6.53988 14.9752L20.8281 6.0991C21.6082 5.54188 22.4069 5.69047 21.7197 6.30345L9.44802 17.472L9.06254 22.1985C9.41958 22.9283 10.0733 22.9317 10.4904 22.569L13.8855 19.3399L19.7002 23.7165C21.0507 24.5202 21.7856 24.0016 22.0761 22.5286L25.8901 4.37579C26.2861 2.56265 25.6108 1.76376 23.8893 2.45844Z"
                      fill="black"
                    />
                  </svg>
                </a>
                <a href="vk">
                  <svg
                    width="41"
                    height="40"
                    viewBox="0 0 41 40"
                    fill="none"
                    xmlns="http://www.w3.org/2000/svg"
                  >
                    <path
                      d="M41 35.5556V4.44444C41 2 38.9432 0 36.4331 0H4.56694C1.9475 0 0 1.89556 0 4.44444V35.5556C0 38.1067 1.9475 40 4.56694 40H36.4331C37.6418 39.9982 38.8006 39.5298 39.6564 38.697C40.5121 37.8642 40.9952 36.7348 41 35.5556ZM32.308 23.5711C32.308 23.5711 34.8864 26.0533 35.5219 27.2044C35.5402 27.2289 35.547 27.2511 35.5538 27.26C35.8112 27.6822 35.8773 28.0156 35.7474 28.26C35.5333 28.6667 34.8044 28.8711 34.5562 28.8889H30.0029C29.684 28.8889 29.0234 28.8089 28.2217 28.2689C27.6067 27.8511 26.9985 27.16 26.4063 26.4867C25.5225 25.4867 24.7572 24.62 23.9873 24.62C23.8896 24.6198 23.7926 24.6355 23.7003 24.6667C23.1149 24.8489 22.3723 25.66 22.3723 27.8267C22.3723 28.5044 21.8257 28.8911 21.4384 28.8911H19.352C18.6413 28.8911 14.9399 28.6489 11.6622 25.2733C7.63967 21.14 4.02711 12.8489 3.99522 12.7756C3.76744 12.24 4.23894 11.9489 4.75144 11.9489H9.35256C9.96983 11.9489 10.168 12.3133 10.3092 12.64C10.4687 13.0111 11.07 14.5089 12.054 16.1933C13.6553 18.9333 14.6416 20.0489 15.4274 20.0489C15.5743 20.0481 15.7186 20.0106 15.8465 19.94C16.8738 19.3867 16.6824 15.8133 16.6369 15.0756C16.6369 14.9356 16.6346 13.4778 16.1107 12.7778C15.7326 12.2711 15.0926 12.0778 14.7053 12.0044C14.8632 11.7922 15.071 11.62 15.3112 11.5022C16.0151 11.16 17.2838 11.1111 18.5457 11.1111H19.2472C20.6162 11.1289 20.9715 11.2156 21.4658 11.3378C22.4657 11.5711 22.4862 12.2044 22.3974 14.36C22.3723 14.9733 22.345 15.6689 22.345 16.4844C22.345 16.66 22.3382 16.8533 22.3382 17.0533C22.3063 18.1556 22.2698 19.4022 23.0671 19.9133C23.1702 19.9763 23.2893 20.0102 23.411 20.0111C23.6889 20.0111 24.5203 20.0111 26.773 16.24C27.7638 14.5756 28.5269 12.6111 28.5793 12.4644C28.6589 12.3059 28.7741 12.1669 28.9164 12.0578C29.0331 11.9987 29.163 11.9689 29.2945 11.9711H34.7042C35.2964 11.9711 35.6973 12.0578 35.7725 12.2778C35.9023 12.6311 35.7474 13.7089 33.2761 16.9667L32.1759 18.3889C29.9346 21.2511 29.9346 21.3978 32.308 23.5711Z"
                      fill="#F9F9F9"
                    />
                  </svg>
                </a>
                <a href="yt">
                  <svg
                    width="32"
                    height="32"
                    viewBox="0 0 32 32"
                    fill="none"
                    xmlns="http://www.w3.org/2000/svg"
                  >
                    <path
                      d="M13.4167 20.0268L20.1205 16.1518L13.4167 12.2768V20.0268ZM28.3484 9.91302C28.5163 10.5201 28.6325 11.3339 28.71 12.3672C28.8005 13.4005 28.8392 14.2918 28.8392 15.0668L28.9167 16.1518C28.9167 18.9805 28.71 21.0601 28.3484 22.3905C28.0255 23.553 27.2763 24.3022 26.1138 24.6251C25.5067 24.793 24.3959 24.9093 22.6909 24.9868C21.0117 25.0772 19.4746 25.1159 18.0538 25.1159L16 25.1934C10.588 25.1934 7.21671 24.9868 5.88629 24.6251C4.72379 24.3022 3.97462 23.553 3.65171 22.3905C3.48379 21.7834 3.36754 20.9697 3.29004 19.9364C3.19962 18.903 3.16087 18.0118 3.16087 17.2368L3.08337 16.1518C3.08337 13.323 3.29004 11.2434 3.65171 9.91302C3.97462 8.75052 4.72379 8.00136 5.88629 7.67844C6.49337 7.51052 7.60421 7.39427 9.30921 7.31677C10.9884 7.22636 12.5255 7.18761 13.9463 7.18761L16 7.11011C21.4121 7.11011 24.7834 7.31677 26.1138 7.67844C27.2763 8.00136 28.0255 8.75052 28.3484 9.91302Z"
                      fill="black"
                    />
                  </svg>
                </a>
              </div>
            </div>
          </div>
          <div className="footer-bottom d-flex-columns">
            <p>2024  ВилкаЛожка | Все права защищены.   </p>
            <p>Автор проекта: Чернышева Виолетта.</p>
          </div>
        </div>
      </Container>
    </footer>
  );
};

export default Footer;
